<a href="https://colab.research.google.com/github/FirmanAhmadBayumi/firmanahmadbayumi/blob/main/2117051062_FirmanAhmadBayumi_B_UTP_AI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# UTP Praktikum Kecerdasan Buatan
Firman Ahmad Bayumi

2117051062

B

Berikut link sumber data yang saya gunakan 

https://raw.githubusercontent.com/mashumabduljabbar/dataset/master/data_titanic.csv

## Library

In [ ]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder
from sklearn.utils import resample
from sklearn.model_selection import train_test_split
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import accuracy_score

## Load Dataset

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/mashumabduljabbar/dataset/master/data_titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Exploratory Data Analisis (EDA)

In [ ]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

## Preprocessing

In [ ]:
# Menghapus kolom yang tidak diperlukan
df = df.drop(['PassengerId', 'Name', 'Ticket', 'Cabin'], axis=1)

# Menghapus baris dengan nilai NaN
df = df.dropna()

# Mengubah nilai pada kolom 'Sex' menjadi angka
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

# Mengubah nilai pada kolom 'Embarked' menjadi angka
df['Embarked'] = df['Embarked'].map({'S': 0, 'C': 1, 'Q': 2})

df

     Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0           0       3    0  22.0      1      0   7.2500         0
1           1       1    1  38.0      1      0  71.2833         1
2           1       3    1  26.0      0      0   7.9250         0
3           1       1    1  35.0      1      0  53.1000         0
4           0       3    0  35.0      0      0   8.0500         0
..        ...     ...  ...   ...    ...    ...      ...       ...
885         0       3    1  39.0      0      5  29.1250         2
886         0       2    0  27.0      0      0  13.0000         0
887         1       1    1  19.0      0      0  30.0000         0
889         1       1    0  26.0      0      0  30.0000         1
890         0       3    0  32.0      0      0   7.7500         2

[712 rows x 8 columns]

### Balancing
proses ini dilakukan karena dataset Titanic tidak seimbang (imbalanced) di mana jumlah penumpang yang selamat jauh lebih sedikit dibandingkan yang tidak selamat.

In [ ]:
# menghitung jumlah penumpang yang survived dan not survived
survived_counts = df['Survived'].value_counts()

# menampilkan hasil
print(survived_counts)

0    424
1    288
Name: Survived, dtype: int64

In [ ]:
# Memisahkan data selamat dan tidak selamat
survived = df[df['Survived'] == 1]
not_survived = df[df['Survived'] == 0]

# Oversampling data selamat
survived_oversampled = resample(survived, replace=True, n_samples=len(not_survived), random_state=42)

# Menggabungkan kembali data yang telah di-oversampling dengan data tidak selamat
df_oversampled = pd.concat([not_survived, survived_oversampled])

# Mencetak jumlah data selamat dan tidak selamat setelah di-oversampling
print(df_oversampled['Survived'].value_counts())

0    424
1    424
Name: Survived, dtype: int64

## Feature Selection

In [ ]:
# Memisahkan fitur dan target
X = df_oversampled.drop('Survived', axis=1)
y = df_oversampled['Survived']

## Splitting Data

In [ ]:
np.random.seed(42)

# Membagi data menjadi data training dan data testing dengan rasio 4:1
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state = 42)

## Modelling

### Decission Tree

In [ ]:
# Inisiasi Decision Tree Classifier
dt = DecisionTreeClassifier()

# Melatih model dengan data training
dt.fit(X_train, y_train)

acc = dt.score(X_test, y_test)
print('Akurasi Decision Tree: {:.2f}%'.format(acc * 100))

Akurasi Decision Tree: 87.65%

## Evaluasi Model
Melakukan evaluasi model menggunakan accuracy_score

In [ ]:
# Memprediksi nilai target pada data testing
y_pred = dt.predict(X_test)

# Menghitung akurasi model
accuracy_dTree = accuracy_score(y_pred, y_test)

print("Akurasi Evaluasi: {:.2f}%".format(accuracy_dTree * 100))

Akurasi Evaluasi: 87.65%

## Data Dummy

### Membuat 5 Data Dummy Baru

In [ ]:
dataDummy = {
    'Name': ['Joko', 'Anwar', 'Rina', 'Juki', 'Sana'],
    'Survived': [1, 0, 0, 1, 1],
    'Gender': [1, 1, 0, 1, 0],
    'Embarked': [1, 0, 0, 1, 1],
    'Pclass': [1, 1, 1, 0, 1],
    }

### Load Dataset Data Dummy

In [ ]:
showDataDummy = pd.DataFrame(dataDummy)
showDataDummy

    Name  Survived  Gender  Embarked  Pclass
0   Joko         1       1         1       1
1  Anwar         0       1         0       1
2   Rina         0       0         0       1
3   Juki         1       1         1       0
4   Sana         1       0         1       1

### Feature Selection

In [ ]:
X = showDataDummy[['Gender', 'Embarked', 'Pclass']]
y = showDataDummy['Survived']

### Splitting Data

In [ ]:
# Membagi data menjadi data training dan data testing dengan rasio 4:1
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)

### Modelling Decission Tree

In [ ]:
# Inisiasi Decision Tree Classifier
dt = DecisionTreeClassifier()

# Melatih model dengan data training
dt.fit(X_train, y_train)

acc = dt.score(X_test, y_test)
print('Akurasi Data: {:.2f}%'.format(acc * 100))

Akurasi Data: 100.00%